Show / Hide Table of Contents
Class CrossSectionFactory
CrossSectionFactory
Inheritance
System.Object
CrossSectionFactory
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class CrossSectionFactory
Methods
Improve this Doc   View Source
FillBox2(CrossSectionParameter, Double, Double, Double, Double, Double, Double, Double)
Box 2 - steel shape
Declaration
public static void FillBox2(CrossSectionParameter css, double bu, double bb, double hw, double b1, double tw, double tfu, double tfb)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  bu
Width of upper flange
 System.Double |  bb
Width of bottom flange
 System.Double |  hw
Height of web
 System.Double |  b1
Web distance
 System.Double |  tw
Web thickness
 System.Double |  tfu
Upper flange thickness
 System.Double |  tfb
Bottom flange thickness
Improve this Doc   View Source
FillCircle(CrossSectionParameter, Double)
Circular shape - for steel or concrete shape
Declaration
public static void FillCircle(CrossSectionParameter css, double d)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  d
Diametrer of the shape
Improve this Doc   View Source
FillColdFormedC(CrossSectionParameter, Double, Double, Double, Double, Double)
Fill parameters for cold formed C section
Declaration
public static void FillColdFormedC(CrossSectionParameter css, double Width, double Height, double Thickness, double Radius, double lip)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  Width
Css width
 System.Double |  Height
Height of cross-section
 System.Double |  Thickness
Thickness
 System.Double |  Radius
Inside radius
 System.Double |  lip
Lip length
Remarks
Dimension of cold formed Z section
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 6;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Width = 0.15;
double Height = 0.20;
double Thickness = 0.003;
double Radius = 0.005;
bool Mirror = false;
CrossSectionFactory.FillColdFormedC(css, Width, Height, Thickness, Radius, Mirror);
openStructModel.AddObject(css);
Improve this Doc   View Source
FillColdFormedGeneral(CrossSectionGeneralColdFormed, Region2D, Double, Double)
Fill center line for general cold formed css
Declaration
public static void FillColdFormedGeneral(CrossSectionGeneralColdFormed gcf, Region2D region2D, double Thickness, double InsideRadius)
Parameters
 Type |  Name |  Description
 CrossSectionGeneralColdFormed |  gcf
 Region2D |  region2D
We need PolyLine2D from region2D
 System.Double |  Thickness
Thickness
 System.Double |  InsideRadius
Inside radius
Improve this Doc   View Source
FillColdFormedL(CrossSectionParameter, Double, Double, Double, Double)
Fill parameters for cold formed L section
Declaration
public static void FillColdFormedL(CrossSectionParameter css, double Width, double Height, double Thickness, double Radius)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  Width
Horizontal leg length
 System.Double |  Height
Vertical leg length
 System.Double |  Thickness
Thickness
 System.Double |  Radius
Inside radius
Remarks
Dimension of cold formed L section
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 9;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Width = 0.10;
double Height = 0.10;
double Thickness = 0.003;
double Radius = 0.005;
CrossSectionFactory.FillColdFormedL(css, Width, Height, Thickness, Radius);
openStructModel.AddObject(css);
Improve this Doc   View Source
FillColdFormedLgen(CrossSectionParameter, Double, Double, Double, Double, Double)
Fill parameters for cold formed L - gen section
Declaration
public static void FillColdFormedLgen(CrossSectionParameter css, double Width, double Height, double Angle, double Thickness, double Radius)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  Width
Horizontal leg length
 System.Double |  Height
Vertical leg length
 System.Double |  Angle
Angle between legs
 System.Double |  Thickness
Thickness
 System.Double |  Radius
Inside radius
Remarks
Dimension of cold formed L - gen section
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 10;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Width = 0.10;
double Height = 0.10;
double Angle = Math.PI / 2.0;
double Thickness = 0.003;
double Radius = 0.005;
CrossSectionFactory.FillColdFormedLgen(css, Width, Height, Angle, Thickness, Radius);
openStructModel.AddObject(css);
Improve this Doc   View Source
FillColdFormedOmega(CrossSectionParameter, Double, Double, Double, Double, Double)
Fill parameters for cold formed Omega section
Declaration
public static void FillColdFormedOmega(CrossSectionParameter css, double Width, double Height, double FlangeWidth, double Thickness, double Radius)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  Width
Css width
 System.Double |  Height
Height of cross-section
 System.Double |  FlangeWidth
Flange width
 System.Double |  Thickness
Thickness
 System.Double |  Radius
Inside radius
Remarks
Dimension of cold formed Omega section
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 8;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Width = 0.20;
double Height = 0.10;
double FlangeWidth = 0.10;
double Thickness = 0.003;
double Radius = 0.005;
CrossSectionFactory.FillColdFormedOmega(css, Width, Height, FlangeWidth, Thickness, Radius);
openStructModel.AddObject(css);
Improve this Doc   View Source
FillColdFormedRegularPolygon(CrossSectionParameter, Double, Int32, Double, Double)
Fill parameters for cold formed Regular polygon section
Declaration
public static void FillColdFormedRegularPolygon(CrossSectionParameter css, double Radius, int Number, double Thickness, double InsideRadius)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  Radius
Radius
 System.Int32 |  Number
Number
 System.Double |  Thickness
Thickness
 System.Double |  InsideRadius
Inside radius
Remarks
Dimension of cold formed Regular polygon section
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 11;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Radius = 0.10;
int Number = 8;
double Thickness = 0.003;
double InsideRadius = 0.005;
CrossSectionFactory.FillColdFormedRegularPolygon(css, Radius, Number, Thickness, InsideRadius);
openStructModel.AddObject(css);
Improve this Doc   View Source
FillColdFormedRHS(CrossSectionParameter, Double, Double, Double, Double)
Fill parameters for cold formed RHS section
Declaration
public static void FillColdFormedRHS(CrossSectionParameter css, double Height, double Width, double Thickness, double InsideRadius)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  Height
Height
 System.Double |  Width
Width
 System.Double |  Thickness
Thickness
 System.Double |  InsideRadius
Inside radius
Remarks
Dimension of cold formed RHS section
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 13;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Height = 0.20;
double Width = 0.15;
double Thickness = 0.005;
double InsideRadius = 0.010;
CrossSectionFactory.FillColdFormedRHS(css, Width, Height, Thickness, InsideRadius);
openStructModel.AddObject(css);
Improve this Doc   View Source
FillColdFormedSigma(CrossSectionParameter, Double, Double, Double, Double, Double, Double, Double, Double)
Fill parameters for cold formed sigma section
Declaration
public static void FillColdFormedSigma(CrossSectionParameter css, double Height, double Width, double Lip, double Thickness, double InsideRadius, double HeightMiddle, double HeightEdge, double Depth)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  Height
Height
 System.Double |  Width
Width
 System.Double |  Lip
Length of lip
 System.Double |  Thickness
Thickness
 System.Double |  InsideRadius
Inside radius
 System.Double |  HeightMiddle
Height of middle part
 System.Double |  HeightEdge
Height of edge part
 System.Double |  Depth
Depth of web-fold
Remarks
Dimension of cold formed sigma section
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 12;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Height = 0.20;
double Width = 0.15;
double Lip = 0.02;
double Thickness = 0.005;
double InsideRadius = 0.010;
double HeightMiddle = 0.10;
double HeightEdge = 0.035;
double Depth = 0.035;
CrossSectionFactory.FillColdFormedSigma(css, Height, Width, Lip, Thickness, InsideRadius, HeightMiddle, HeightEdge, Depth);
openStructModel.AddObject(css);
Improve this Doc   View Source
FillColdFormedZ(CrossSectionParameter, Double, Double, Double, Double, Boolean)
Fill parameters for cold formed Z section
Declaration
public static void FillColdFormedZ(CrossSectionParameter css, double Width, double Height, double Thickness, double Radius, bool Mirror)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  Width
Css width
 System.Double |  Height
Height of cross-section
 System.Double |  Thickness
Thickness
 System.Double |  Radius
Inside radius
 System.Boolean |  Mirror
Mirrored shape
Remarks
Dimension of cold formed Z section
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 6;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Width = 0.15;
double Height = 0.20;
double Thickness = 0.003;
double Radius = 0.005;
bool Mirror = false;
CrossSectionFactory.FillColdFormedZ(css, Width, Height, Thickness, Radius, Mirror);
openStructModel.AddObject(css);
Improve this Doc   View Source
FillColdFormedZed(CrossSectionParameter, Double, Double, Double, Double, Double, Boolean)
Fill parameters for cold formed Z-ed section
Declaration
public static void FillColdFormedZed(CrossSectionParameter css, double Width, double Height, double Thickness, double Radius, double Lip, bool Mirror)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  Width
Css width
 System.Double |  Height
Height of cross-section
 System.Double |  Thickness
Thickness
 System.Double |  Radius
Inside radius
 System.Double |  Lip
Lip length
 System.Boolean |  Mirror
Mirrored shape
Remarks
Dimension of cold formed Z-ed section
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 7;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Width = 0.15;
double Height = 0.20;
double Thickness = 0.004;
double Radius = 0.01;
double Lip = 0.02;
bool Mirror = false;
CrossSectionFactory.FillColdFormedZed(css, Width, Height, Thickness, Radius, Lip, Mirror);
openStructModel.AddObject(css);
Improve this Doc   View Source
FillCssIarc(CrossSectionParameter, Double, Double, Double, Double, Double, Double, Double)
Fill steel section of parametric I section
Declaration
public static void FillCssIarc(CrossSectionParameter css, double cssGeomB, double cssGeomH, double cssGeomS, double cssGeomT, double cssGeomR2, double tapperF, double r1)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  cssGeomB
Css width
 System.Double |  cssGeomH
Height of cross-section
 System.Double |  cssGeomS
Web thickness
 System.Double |  cssGeomT
Flange thickness
 System.Double |  cssGeomR2
inside radius
 System.Double |  tapperF
Flange tapper
 System.Double |  r1
Flange edge rounding radius
Remarks
Dimension of parametric I section
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 8;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double cssGeomB = 0.25;
double cssGeomH = 0.45;
double cssGeomS = 0.02;
double cssGeomT = 0.03;
double cssGeomR2 = 0.012;
double tapperF = Math.PI / 180.0 * 5.0;
double r1 = 0.015;
CrossSectionFactory.FillCssIarc(css, cssGeomB, cssGeomH, cssGeomS, cssGeomT, cssGeomR2, tapperF, r1);
openStructModel.AddObject(css);
Improve this Doc   View Source
FillCssRectangleHollow(CrossSectionParameter, Double, Double, Double, Double, Double, Double)
Fill cross-section of shape rectangular for concrete sections
Declaration
public static void FillCssRectangleHollow(CrossSectionParameter cssO, double width, double height, double thickLeft, double thickRight, double thickTop, double thickBottom)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  cssO
Parameters of CrossSectionParameter will be filled
 System.Double |  width
The width of css.
 System.Double |  height
The height of css.
 System.Double |  thickLeft
The thickness at the left side.
 System.Double |  thickRight
The thickness at the rigth side.
 System.Double |  thickTop
The thickness at the top.
 System.Double |  thickBottom
The thickness at the bottom.
Improve this Doc   View Source
FillCssSteelAngle(CrossSectionParameter, Double, Double, Double, Double, Double, Double, Boolean)
Fill steel section of angle shape
Declaration
public static void FillCssSteelAngle(CrossSectionParameter css, double B, double D, double t, double rw, double r2, double C, bool mirrorZ = false)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  B
width
 System.Double |  D
depth
 System.Double |  t
thickness
 System.Double |  rw
root radius
 System.Double |  r2
toe radius
 System.Double |  C
centroid position
 System.Boolean |  mirrorZ
profile can be mirrored
Remarks
Dimension of angle section
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 4;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double B = 0.2;
double D = 0.4;
double t = 0.025;
double rw = 0.004;
double r2 = 0.002;
double C = 0.0;
bool mirrorZ = false;
CrossSectionFactory.FillCssSteelAngle(css, B, D, t, rw, r2, C, mirrorZ);
openStructModel.AddObject(css);
Improve this Doc   View Source
FillCssSteelChannel(CrossSectionParameter, Double, Double, Double, Double, Double, Double, Double)
Create steel section Channel shape - steel shape
Declaration
public static void FillCssSteelChannel(CrossSectionParameter css, double B, double D, double tw, double tf, double rw, double rf, double taperF)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  B
width
 System.Double |  D
depth
 System.Double |  tw
web thickness
 System.Double |  tf
flange thickness
 System.Double |  rw
root radius
 System.Double |  rf
flange edge rounding radius
 System.Double |  taperF
Flange taper
Improve this Doc   View Source
FillCssSteelRectangularHollow(CrossSectionParameter, Double, Double, Double, Double, Double, Double)
Fill cross-section of shape rectangular for steel sections
Declaration
public static void FillCssSteelRectangularHollow(CrossSectionParameter cssO, double D, double B, double t, double r1, double r2, double d)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  cssO
Parameters of CrossSectionParameter will be filled
 System.Double |  D
depth
 System.Double |  B
width
 System.Double |  t
thickness
 System.Double |  r1
inner radius
 System.Double |  r2
outer radius
 System.Double |  d
web buckling depth
Improve this Doc   View Source
FillCssTarc(CrossSectionParameter, Double, Double, Double, Double, Double, Double, Double, Double, Double)
Creates one item cross-section T - steel shape
Declaration
public static void FillCssTarc(CrossSectionParameter css, double cssGeomB, double cssGeomH, double cssGeomTw, double cssGeomTf, double cssGeomR, double cssGeomR1, double cssGeomR2, double tapperF, double tapperW)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  cssGeomB
Css width
 System.Double |  cssGeomH
Height of cross-section
 System.Double |  cssGeomTw
Web thickness
 System.Double |  cssGeomTf
Flange thickness
 System.Double |  cssGeomR
Inside radius
 System.Double |  cssGeomR1
Flange edge rounding radius
 System.Double |  cssGeomR2
Web edge rounding radius
 System.Double |  tapperF
Flange tapper
 System.Double |  tapperW
Web tapper
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 9;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double cssGeomB = 0.25;
double cssGeomH = 0.30;
double cssGeomTw = 0.02;
double cssGeomTf = 0.03;
double cssGeomR = 0.015;
double cssGeomR1 = 0.008;
double cssGeomR2 = 0.0010;
double tapperF = Math.PI / 180.0 * 5.0;
double tapperW = Math.PI / 180.0 * 7.0;
CrossSectionFactory.FillCssTarc(css, cssGeomB, cssGeomH, cssGeomTw, cssGeomTf, cssGeomR, cssGeomR1, cssGeomR2, tapperF, tapperW);
openStructModel.AddObject(css);
Improve this Doc   View Source
FillCHSPar(CrossSectionParameter, Double, Double)
Circular hollow section - steel shape
Declaration
public static void FillCHSPar(CrossSectionParameter css, double D, double t)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  D
Diameter
 System.Double |  t
thickness
Improve this Doc   View Source
FillOHollow(CrossSectionParameter, Double, Double)
Fill massive pipe shape
Declaration
public static void FillOHollow(CrossSectionParameter cssO, double r, double t)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  cssO
Parameters of CrossSectionParameter will be filled
 System.Double |  r
The radius of circle.
 System.Double |  t
The thickness of wall.
Improve this Doc   View Source
FillRectangle(CrossSectionParameter, Double, Double)
Rectangle shape - massive concrete shape
Declaration
public static void FillRectangle(CrossSectionParameter css, double width, double height)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  width
Width of the rectangle
 System.Double |  height
Height of the rectangle
Improve this Doc   View Source
FillShapeDblL(CrossSectionParameter, Double, Double, Double, Double, Double)
Creates a new L shape css
Declaration
public static void FillShapeDblL(CrossSectionParameter css, double h, double b, double th, double sh, double dis)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  h
The height of css.
 System.Double |  b
The width of css.
 System.Double |  th
The bottom flange thisckness.
 System.Double |  sh
The wall thickness.
 System.Double |  dis
Distance between
Improve this Doc   View Source
FillShapeDblLu(CrossSectionParameter, Double, Double, Double, Double, Double)
Creates a new L shape css.
Declaration
public static void FillShapeDblLu(CrossSectionParameter css, double h, double b, double th, double sh, double dis)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  h
The height of css.
 System.Double |  b
The width of css.
 System.Double |  th
The bottom flange thisckness.
 System.Double |  sh
The wall thickness.
 System.Double |  dis
Distance between
Improve this Doc   View Source
FillShapeDblU(CrossSectionParameter, Double, Double, Double, Double, Double, Double, Double)
Creates a ][ steel shape of css.
Declaration
public static void FillShapeDblU(CrossSectionParameter css, double bt, double bb, double h, double tb, double tl, double tr, double dis)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  bt
The width of U top flange.
 System.Double |  bb
The width of U bottom flange.
 System.Double |  h
The height of U shape.
 System.Double |  tb
The bottom deck thickness.
 System.Double |  tl
The left deck thickness.
 System.Double |  tr
The right deck thickness.
 System.Double |  dis
Distance between ][
Remarks
Dimension of assymetrical I section
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 5;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double bt = 0.150;
double bb = 0.180;
double h = 0.320;
double tb = 0.016;
double tfu = 0.014;
double tfb = 0.018;
double dis= 0.025;
CrossSectionFactory.FillShapeDblU(css, bt, bb, h, tb, tl, tr, dis);
openStructModel.AddObject(css);
Improve this Doc   View Source
FillShapeI(CrossSectionParameter, Double, Double, Double, Double, Double, Double)
I shape - massive concrete shape
Declaration
public static void FillShapeI(CrossSectionParameter css, double h, double btf, double bbf, double htf, double hbf, double tw)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  h
Total height
 System.Double |  btf
Width of the upper part
 System.Double |  bbf
Width of the bottom part
 System.Double |  htf
Thickness of the upper part
 System.Double |  hbf
Thickness of the bottom part
 System.Double |  tw
Thinkness of the web
Improve this Doc   View Source
FillShapeL(CrossSectionParameter, Double, Double, Double, Double)
Creates a new L shape css - massive concrete shape
Declaration
public static void FillShapeL(CrossSectionParameter css, double h, double b, double th, double sh)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  h
The height of css.
 System.Double |  b
The width of css.
 System.Double |  th
The bottom flange thisckness.
 System.Double |  sh
The wall thickness.
Improve this Doc   View Source
FillShapeT(CrossSectionParameter, Double, Double, Double, Double)
T shape - massive concrete shape
Declaration
public static void FillShapeT(CrossSectionParameter css, double b, double h, double hf, double bw)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  b
Width of shape
 System.Double |  h
Height of shape
 System.Double |  hf
Top flange width
 System.Double |  bw
Wall width
Improve this Doc   View Source
FillShapeTrev(CrossSectionParameter, Double, Double, Double, Double)
T turned shape - massive concrete shape
Declaration
public static void FillShapeTrev(CrossSectionParameter css, double b, double h, double hf, double bw)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  b
Width of shape
 System.Double |  h
Height of shape
 System.Double |  hf
Top flange width
 System.Double |  bw
Wall width
Improve this Doc   View Source
FillShapeU(CrossSectionParameter, Double, Double, Double, Double, Double, Double)
Creates a U shape of css.
Declaration
public static void FillShapeU(CrossSectionParameter css, double bt, double bb, double h, double tb, double tl, double tr)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  bt
The width of U top flange.
 System.Double |  bb
The width of U bottom flange.
 System.Double |  h
The height of U shape.
 System.Double |  tb
The bottom deck thickness.
 System.Double |  tl
The left deck thickness.
 System.Double |  tr
The right deck thickness.
Improve this Doc   View Source
FillSteelTI(CrossSectionParameter, String, Double)
Fill steel T profile made from part of I profile
Declaration
public static void FillSteelTI(CrossSectionParameter cssO, string name, double H)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  cssO
Parameters of CrossSectionParameter will be filled
 System.String |  name
Name
 System.Double |  H
Height
Improve this Doc   View Source
FillSteelTube(CrossSectionParameter, Double, Double)
Fill steel tube
Declaration
public static void FillSteelTube(CrossSectionParameter cssO, double r, double t)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  cssO
Parameters of CrossSectionParameter will be filled
 System.Double |  r
The radius of circle.
 System.Double |  t
The thickness of wall.
Improve this Doc   View Source
FillWelded2Lt(CrossSectionParameter, String, Double)
Fill steel section Lt shape
Declaration
public static void FillWelded2Lt(CrossSectionParameter cssO, string name, double Distance)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  cssO
Parameters of CrossSectionParameter will be filled
 System.String |  name
Name
 System.Double |  Distance
Distance
Improve this Doc   View Source
FillWelded2Lu(CrossSectionParameter, String, Double)
Fill steel section Lu shape
Declaration
public static void FillWelded2Lu(CrossSectionParameter cssO, string name, double Distance)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  cssO
Parameters of CrossSectionParameter will be filled
 System.String |  name
Name
 System.Double |  Distance
Distance
Improve this Doc   View Source
FillWelded2Uc(CrossSectionParameter, String, Double)
Fill steel section Channel shape
Declaration
public static void FillWelded2Uc(CrossSectionParameter cssO, string name, double Distance)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  cssO
Parameters of CrossSectionParameter will be filled
 System.String |  name
Name
 System.Double |  Distance
Distance
Improve this Doc   View Source
FillWeldedAsymI(CrossSectionParameter, Double, Double, Double, Double, Double, Double)
Welded I asymetrical - steel shape
Declaration
public static void FillWeldedAsymI(CrossSectionParameter css, double bu, double bb, double hw, double tw, double tfu, double tfb)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  bu
Width of upper flange
 System.Double |  bb
Width of bottom flange
 System.Double |  hw
Height of web
 System.Double |  tw
Web thickness
 System.Double |  tfu
Upper flange thickness
 System.Double |  tfb
Bottom flange thickness
Remarks
Dimension of assymetrical I section
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 4;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double bu = 0.150;
double bb = 0.180;
double hw = 0.320;
double tw = 0.016;
double tfu = 0.014;
double tfb = 0.018;
CrossSectionFactory.FillWeldedAsymI(css, bu, bb, hw, tw, tfu, tfb);
openStructModel.AddObject(css);
Improve this Doc   View Source
FillWeldedI(CrossSectionParameter, Double, Double, Double, Double)
Fill steel section of welded I
Declaration
public static void FillWeldedI(CrossSectionParameter css, double bu, double hw, double tw, double tf)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  bu
Width of flange
 System.Double |  hw
Height of web
 System.Double |  tw
Web thickness
 System.Double |  tf
Flange thickness
Remarks
Dimension of welded I section
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 1;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());  // I have only one material, I take the first one
double bu = 0.2;
double hw = 0.4;
double tw = 0.025;
double tf = 0.02;
CrossSectionFactory.FillWeldedI(css, bu, hw, tw, tf);
openStructModel.AddObject(css);
Improve this Doc   View Source
FillWeldedT(CrossSectionParameter, Double, Double, Double, Double)
Fill steel section of welded T
Declaration
public static void FillWeldedT(CrossSectionParameter css, double b, double h, double tw, double tf)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  css
Parameters of CrossSectionParameter will be filled
 System.Double |  b
Width of flange
 System.Double |  h
Height of web
 System.Double |  tw
Web thickness
 System.Double |  tf
Flange thickness
Remarks
Dimension of welded T section
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 2;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double b = 0.2;
double h = 0.4;
double tw = 0.02;
double tf = 0.35;
CrossSectionFactory.FillWeldedT(css, b, h, tw, tf);
openStructModel.AddObject(css);
Improve this Doc   View Source
FillWeldedU(CrossSectionParameter, Double, Double, Double, Double, Double, Double, Double)
Fill steel section of channel shape
Declaration
public static void FillWeldedU(CrossSectionParameter cssO, double b, double hw, double tw, double tf, double rw, double rf, double taperF)
Parameters
 Type |  Name |  Description
 CrossSectionParameter |  cssO
Parameters of CrossSectionParameter will be filled
 System.Double |  b
width
 System.Double |  hw
depth
 System.Double |  tw
web thickness
 System.Double |  tf
flange thickness
 System.Double |  rw
root radius
 System.Double |  rf
flange edge rounding radius
 System.Double |  taperF
Flange taper
Remarks
Dimension of channel section
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 3;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double b = 0.2;
double hw = 0.4;
double tw = 0.025;
double tf= 0.02;
double rw= 0.004;
double rf = 0.002;
double taperF = 0.001;
CrossSectionFactory.FillWeldedU(css, b, hw, tw, tf, rw, rf, taperF);
openStructModel.AddObject(css);
 Improve this Doc
 View Source